var data = [
 {
   "班級": 201,
   "座號": 1,
   "姓名": "劉承旭",
   "性別": "男",
   "國平均": "96.6",
   "數平均": "94.6",
   "國數平均": "95.6",
   "加註": "g"
 },
 {
   "班級": 201,
   "座號": 2,
   "姓名": "劉正新",
   "性別": "男",
   "國平均": "93.2",
   "數平均": "94.2",
   "國數平均": "93.7",
   "加註": "g"
 },
 {
   "班級": 201,
   "座號": 4,
   "姓名": "鄧毅賢",
   "性別": "男",
   "國平均": "79.4",
   "數平均": "85.2",
   "國數平均": "82.3",
   "加註": "chd"
 },
 {
   "班級": 201,
   "座號": 5,
   "姓名": "范祐銘",
   "性別": "男",
   "國平均": "91.4",
   "數平均": "95",
   "國數平均": "93.2",
   "加註": "h"
 },
 {
   "班級": 201,
   "座號": 6,
   "姓名": "方奕承",
   "性別": "男",
   "國平均": "87.8",
   "數平均": "93.8",
   "國數平均": "90.8",
   "加註": "h"
 },
 {
   "班級": 201,
   "座號": 7,
   "姓名": "曹子德",
   "性別": "男",
   "國平均": "85.6",
   "數平均": "81",
   "國數平均": "83.3",
   "加註": "f(雅靜)"
 },
 {
   "班級": 201,
   "座號": 8,
   "姓名": "劉郡",
   "性別": "男",
   "國平均": "94.8",
   "數平均": "94.6",
   "國數平均": "94.7",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 9,
   "姓名": "陳羿豪",
   "性別": "男",
   "國平均": "98.6",
   "數平均": "97.2",
   "國數平均": "97.9",
   "加註": "g"
 },
 {
   "班級": 201,
   "座號": 10,
   "姓名": "陳樺",
   "性別": "男",
   "國平均": "97.2",
   "數平均": "85",
   "國數平均": "91.1",
   "加註": "h"
 },
 {
   "班級": 201,
   "座號": 11,
   "姓名": "蕭光甫",
   "性別": "男",
   "國平均": "97.4",
   "數平均": "96.2",
   "國數平均": "96.8",
   "加註": "f()"
 },
 {
   "班級": 201,
   "座號": 12,
   "姓名": "彭逸昕",
   "性別": "男",
   "國平均": "99",
   "數平均": "96.8",
   "國數平均": "97.9",
   "加註": "g"
 },
 {
   "班級": 201,
   "座號": 13,
   "姓名": "蔡喆凱",
   "性別": "男",
   "國平均": "88.8",
   "數平均": "90.2",
   "國數平均": "89.5",
   "加註": "ch"
 },
 {
   "班級": 201,
   "座號": 14,
   "姓名": "姜怡安",
   "性別": "女",
   "國平均": "97.8",
   "數平均": "98.4",
   "國數平均": "98.1",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 15,
   "姓名": "蘇湘筠",
   "性別": "女",
   "國平均": "98.2",
   "數平均": "99.2",
   "國數平均": "98.7",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 16,
   "姓名": "胡羽薇",
   "性別": "女",
   "國平均": "98.4",
   "數平均": "94.6",
   "國數平均": "96.5",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 17,
   "姓名": "賴莨宜",
   "性別": "女",
   "國平均": "96",
   "數平均": "90",
   "國數平均": "93",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 18,
   "姓名": "張雲紫",
   "性別": "女",
   "國平均": "96",
   "數平均": "96.4",
   "國數平均": "96.2",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 19,
   "姓名": "孔德芸",
   "性別": "女",
   "國平均": "96.6",
   "數平均": "94.4",
   "國數平均": "95.5",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 20,
   "姓名": "呂沛妤",
   "性別": "女",
   "國平均": "96",
   "數平均": "92.8",
   "國數平均": "94.4",
   "加註": ""
 },
 {
   "班級": 201,
   "座號": 21,
   "姓名": "陳韻之",
   "性別": "女",
   "國平均": "98.6",
   "數平均": "98.8",
   "國數平均": "98.7",
   "加註": "f(美蘭)"
 },
 {
   "班級": 201,
   "座號": 22,
   "姓名": "陳盈盈",
   "性別": "女",
   "國平均": "82.2",
   "數平均": "73.4",
   "國數平均": "77.8",
   "加註": "d"
 },
 {
   "班級": 201,
   "座號": 23,
   "姓名": "黃楉庭",
   "性別": "女",
   "國平均": "93",
   "數平均": "77.2",
   "國數平均": "85.1",
   "加註": "d"
 },
 {
   "班級": 201,
   "座號": 24,
   "姓名": "張佑愷",
   "性別": "男",
   "國平均": "82.8",
   "數平均": "76.6",
   "國數平均": "79.7",
   "加註": "d"
 },
 {
   "班級": 201,
   "座號": 25,
   "姓名": "宋梓豪",
   "性別": "男",
   "國平均": "75.8",
   "數平均": "72.2",
   "國數平均": "74",
   "加註": "bch"
 },
 {
   "班級": 202,
   "座號": 1,
   "姓名": "王宥鈞",
   "性別": "男",
   "國平均": "96.8",
   "數平均": "93.8",
   "國數平均": "95.3",
   "加註": "f()"
 },
 {
   "班級": 202,
   "座號": 2,
   "姓名": "周廷恩",
   "性別": "男",
   "國平均": "97.8",
   "數平均": "97",
   "國數平均": "97.4",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 3,
   "姓名": "羅辰嘉",
   "性別": "男",
   "國平均": "97.4",
   "數平均": "89.8",
   "國數平均": "93.6",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 4,
   "姓名": "田盛義",
   "性別": "男",
   "國平均": "98.2",
   "數平均": "98.2",
   "國數平均": "98.2",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 5,
   "姓名": "張格綸",
   "性別": "男",
   "國平均": "90",
   "數平均": "91.2",
   "國數平均": "90.6",
   "加註": "b"
 },
 {
   "班級": 202,
   "座號": 6,
   "姓名": "李則銘",
   "性別": "男",
   "國平均": "96.4",
   "數平均": "94.8",
   "國數平均": "95.6",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 7,
   "姓名": "張亦程",
   "性別": "男",
   "國平均": "98.2",
   "數平均": "96.2",
   "國數平均": "97.2",
   "加註": "h"
 },
 {
   "班級": 202,
   "座號": 8,
   "姓名": "彭弘凱",
   "性別": "男",
   "國平均": "96.2",
   "數平均": "88.6",
   "國數平均": "92.4",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 9,
   "姓名": "陳宇恆",
   "性別": "男",
   "國平均": "86.2",
   "數平均": "82.6",
   "國數平均": "84.4",
   "加註": "bh"
 },
 {
   "班級": 202,
   "座號": 10,
   "姓名": "曾瑞誠",
   "性別": "男",
   "國平均": "93",
   "數平均": "90.4",
   "國數平均": "91.7",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 11,
   "姓名": "涂家華",
   "性別": "男",
   "國平均": "98",
   "數平均": "88.2",
   "國數平均": "93.1",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 12,
   "姓名": "黃富彬",
   "性別": "男",
   "國平均": "94.8",
   "數平均": "92.8",
   "國數平均": "93.8",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 13,
   "姓名": "羅峻岳",
   "性別": "男",
   "國平均": "70.6",
   "數平均": "69",
   "國數平均": "69.8",
   "加註": "ch"
 },
 {
   "班級": 202,
   "座號": 14,
   "姓名": "李承叡",
   "性別": "男",
   "國平均": "92.4",
   "數平均": "86.4",
   "國數平均": "89.4",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 15,
   "姓名": "楊亞軒",
   "性別": "女",
   "國平均": "92.4",
   "數平均": "93.6",
   "國數平均": "93",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 16,
   "姓名": "官嘉禕",
   "性別": "女",
   "國平均": "96.6",
   "數平均": "95.8",
   "國數平均": "96.2",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 17,
   "姓名": "彭若晴",
   "性別": "女",
   "國平均": "97.8",
   "數平均": "96.4",
   "國數平均": "97.1",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 18,
   "姓名": "溫昱亘",
   "性別": "女",
   "國平均": "65.8",
   "數平均": "68.4",
   "國數平均": "67.1",
   "加註": "d"
 },
 {
   "班級": 202,
   "座號": 19,
   "姓名": "謝瑄舫",
   "性別": "女",
   "國平均": "94.4",
   "數平均": "92.6",
   "國數平均": "93.5",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 20,
   "姓名": "劉昱玟",
   "性別": "女",
   "國平均": "93.2",
   "數平均": "83.8",
   "國數平均": "88.5",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 21,
   "姓名": "詹凱涵",
   "性別": "女",
   "國平均": "97.4",
   "數平均": "93.6",
   "國數平均": "95.5",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 22,
   "姓名": "駱采宜",
   "性別": "女",
   "國平均": "78.2",
   "數平均": "66.4",
   "國數平均": "72.3",
   "加註": "c"
 },
 {
   "班級": 202,
   "座號": 23,
   "姓名": "林逸悅",
   "性別": "女",
   "國平均": "97.4",
   "數平均": "94.6",
   "國數平均": "96",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 24,
   "姓名": "吳羽芩",
   "性別": "女",
   "國平均": "95.4",
   "數平均": "93",
   "國數平均": "94.2",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 25,
   "姓名": "詹品妍",
   "性別": "女",
   "國平均": "97.2",
   "數平均": "94.2",
   "國數平均": "95.7",
   "加註": ""
 },
 {
   "班級": 202,
   "座號": 26,
   "姓名": "馬睿",
   "性別": "女",
   "國平均": "89",
   "數平均": "89.5",
   "國數平均": "89.25",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 1,
   "姓名": "陳瑞銘",
   "性別": "男",
   "國平均": "64.8",
   "數平均": "57.4",
   "國數平均": "61.1",
   "加註": "h"
 },
 {
   "班級": 203,
   "座號": 2,
   "姓名": "古育禾",
   "性別": "男",
   "國平均": "95.8",
   "數平均": "95.4",
   "國數平均": "95.6",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 3,
   "姓名": "黃誠崴",
   "性別": "男",
   "國平均": "81.2",
   "數平均": "87.4",
   "國數平均": "84.3",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 4,
   "姓名": "郭展華",
   "性別": "男",
   "國平均": "95.8",
   "數平均": "94.4",
   "國數平均": "95.1",
   "加註": "b、e陳源叡"
 },
 {
   "班級": 203,
   "座號": 5,
   "姓名": "張智銜",
   "性別": "男",
   "國平均": "88.2",
   "數平均": "75.6",
   "國數平均": "81.9",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 6,
   "姓名": "古博菖",
   "性別": "男",
   "國平均": "93.2",
   "數平均": "95",
   "國數平均": "94.1",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 7,
   "姓名": "林合竟",
   "性別": "男",
   "國平均": "87.8",
   "數平均": "73.4",
   "國數平均": "80.6",
   "加註": "h"
 },
 {
   "班級": 203,
   "座號": 8,
   "姓名": "林祐丞",
   "性別": "男",
   "國平均": "87",
   "數平均": "72.2",
   "國數平均": "79.6",
   "加註": "b+"
 },
 {
   "班級": 203,
   "座號": 9,
   "姓名": "呂仁哲",
   "性別": "男",
   "國平均": "92.2",
   "數平均": "85",
   "國數平均": "88.6",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 10,
   "姓名": "黃宇頡",
   "性別": "男",
   "國平均": "96.6",
   "數平均": "96.6",
   "國數平均": "96.6",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 11,
   "姓名": "曾宥崙",
   "性別": "男",
   "國平均": "94",
   "數平均": "86.6",
   "國數平均": "90.3",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 12,
   "姓名": "陳源叡",
   "性別": "男",
   "國平均": "95",
   "數平均": "93.8",
   "國數平均": "94.4",
   "加註": "h、e郭展華"
 },
 {
   "班級": 203,
   "座號": 13,
   "姓名": "廖延鑫",
   "性別": "男",
   "國平均": "88.8",
   "數平均": "90.4",
   "國數平均": "89.6",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 14,
   "姓名": "余柏鴻",
   "性別": "男",
   "國平均": "93.6",
   "數平均": "84.4",
   "國數平均": "89",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 15,
   "姓名": "范宇姍",
   "性別": "女",
   "國平均": "94.8",
   "數平均": "87.2",
   "國數平均": "91",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 16,
   "姓名": "蘇芸臻",
   "性別": "女",
   "國平均": "93.6",
   "數平均": "83.6",
   "國數平均": "88.6",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 17,
   "姓名": "陳梓瑄",
   "性別": "女",
   "國平均": "99",
   "數平均": "94.8",
   "國數平均": "96.9",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 18,
   "姓名": "夏佩妘",
   "性別": "女",
   "國平均": "95.4",
   "數平均": "86.8",
   "國數平均": "91.1",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 19,
   "姓名": "葉子琛",
   "性別": "女",
   "國平均": "95.4",
   "數平均": "94.2",
   "國數平均": "94.8",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 20,
   "姓名": "王姿涵",
   "性別": "女",
   "國平均": "93.4",
   "數平均": "90.2",
   "國數平均": "91.8",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 21,
   "姓名": "林宣妤",
   "性別": "女",
   "國平均": "95",
   "數平均": "87.8",
   "國數平均": "91.4",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 22,
   "姓名": "張甯翎",
   "性別": "女",
   "國平均": "91",
   "數平均": "89.2",
   "國數平均": "90.1",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 23,
   "姓名": "范芷綺",
   "性別": "女",
   "國平均": "92.8",
   "數平均": "81.2",
   "國數平均": "87",
   "加註": ""
 },
 {
   "班級": 203,
   "座號": 24,
   "姓名": "陳豊雅",
   "性別": "女",
   "國平均": "96.6",
   "數平均": "85.4",
   "國數平均": "91",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 1,
   "姓名": "孟宸至",
   "性別": "男",
   "國平均": "95",
   "數平均": "93.2",
   "國數平均": "94.1",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 2,
   "姓名": "徐朝榮",
   "性別": "男",
   "國平均": "88",
   "數平均": "89.6",
   "國數平均": "88.8",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 3,
   "姓名": "郭宣辰",
   "性別": "男",
   "國平均": "82.6",
   "數平均": "77.8",
   "國數平均": "80.2",
   "加註": "b+"
 },
 {
   "班級": 204,
   "座號": 4,
   "姓名": "林律銘",
   "性別": "男",
   "國平均": "92.2",
   "數平均": "93.8",
   "國數平均": "93",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 5,
   "姓名": "曾聖澄",
   "性別": "男",
   "國平均": "95.2",
   "數平均": "96",
   "國數平均": "95.6",
   "加註": "b"
 },
 {
   "班級": 204,
   "座號": 6,
   "姓名": "陳佑杰",
   "性別": "男",
   "國平均": "98.4",
   "數平均": "94.6",
   "國數平均": "96.5",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 7,
   "姓名": "許司翰",
   "性別": "男",
   "國平均": "94",
   "數平均": "99.4",
   "國數平均": "96.7",
   "加註": "b+"
 },
 {
   "班級": 204,
   "座號": 8,
   "姓名": "温邦棋",
   "性別": "男",
   "國平均": "94.8",
   "數平均": "90.4",
   "國數平均": "92.6",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 9,
   "姓名": "王品昊",
   "性別": "男",
   "國平均": "91.2",
   "數平均": "82.2",
   "國數平均": "86.7",
   "加註": "h"
 },
 {
   "班級": 204,
   "座號": 10,
   "姓名": "陳雍爵",
   "性別": "男",
   "國平均": "95.4",
   "數平均": "88.6",
   "國數平均": "92",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 11,
   "姓名": "簡鴻鈞",
   "性別": "男",
   "國平均": "94.4",
   "數平均": "90",
   "國數平均": "92.2",
   "加註": "b"
 },
 {
   "班級": 204,
   "座號": 12,
   "姓名": "孫萬程",
   "性別": "男",
   "國平均": "96.8",
   "數平均": "94",
   "國數平均": "95.4",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 13,
   "姓名": "林子傑",
   "性別": "男",
   "國平均": "95",
   "數平均": "86.6",
   "國數平均": "90.8",
   "加註": "b+、g"
 },
 {
   "班級": 204,
   "座號": 14,
   "姓名": "李孟桓",
   "性別": "男",
   "國平均": "93",
   "數平均": "93.8",
   "國數平均": "93.4",
   "加註": "b-"
 },
 {
   "班級": 204,
   "座號": 15,
   "姓名": "張邑榛",
   "性別": "女",
   "國平均": "95.6",
   "數平均": "91.6",
   "國數平均": "93.6",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 16,
   "姓名": "賴怡雯",
   "性別": "女",
   "國平均": "95",
   "數平均": "97.8",
   "國數平均": "96.4",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 17,
   "姓名": "劉宇庭",
   "性別": "女",
   "國平均": "95.4",
   "數平均": "89.8",
   "國數平均": "92.6",
   "加註": "g"
 },
 {
   "班級": 204,
   "座號": 18,
   "姓名": "何柔誼",
   "性別": "女",
   "國平均": "89.4",
   "數平均": "72.8",
   "國數平均": "81.1",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 19,
   "姓名": "王妤婕",
   "性別": "女",
   "國平均": "86.6",
   "數平均": "74.6",
   "國數平均": "80.6",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 20,
   "姓名": "張薰勻",
   "性別": "女",
   "國平均": "95.2",
   "數平均": "80.2",
   "國數平均": "87.7",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 21,
   "姓名": "范雅涵",
   "性別": "女",
   "國平均": "96.8",
   "數平均": "95.2",
   "國數平均": "96",
   "加註": ""
 },
 {
   "班級": 204,
   "座號": 23,
   "姓名": "戴菲菲",
   "性別": "女",
   "國平均": "76.2",
   "數平均": "72",
   "國數平均": "74.1",
   "加註": "h"
 },
 {
   "班級": 204,
   "座號": 24,
   "姓名": "孫楚芸",
   "性別": "女",
   "國平均": "94.6",
   "數平均": "86.6",
   "國數平均": "90.6",
   "加註": "h"
 },
 {
   "班級": 204,
   "座號": 25,
   "姓名": "葉芷芯",
   "性別": "女",
   "國平均": "82.4",
   "數平均": "81.8",
   "國數平均": "82.1",
   "加註": "c"
 },
 {
   "班級": 205,
   "座號": 1,
   "姓名": "黃柏崴",
   "性別": "男",
   "國平均": "95.4",
   "數平均": "95.6",
   "國數平均": "95.5",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 2,
   "姓名": "蔡品宇",
   "性別": "男",
   "國平均": "97",
   "數平均": "94.8",
   "國數平均": "95.9",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 3,
   "姓名": "陳禮麒",
   "性別": "男",
   "國平均": "89.2",
   "數平均": "89",
   "國數平均": "89.1",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 4,
   "姓名": "彭靖宸",
   "性別": "男",
   "國平均": "98.2",
   "數平均": "97.6",
   "國數平均": "97.9",
   "加註": "b"
 },
 {
   "班級": 205,
   "座號": 5,
   "姓名": "林冠宇",
   "性別": "男",
   "國平均": "96",
   "數平均": "92.8",
   "國數平均": "94.4",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 6,
   "姓名": "曾喬禹",
   "性別": "男",
   "國平均": "96.6",
   "數平均": "93.2",
   "國數平均": "94.9",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 7,
   "姓名": "蔡語宸",
   "性別": "男",
   "國平均": "97.4",
   "數平均": "97.4",
   "國數平均": "97.4",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 8,
   "姓名": "謝睿中",
   "性別": "男",
   "國平均": "98.6",
   "數平均": "96.4",
   "國數平均": "97.5",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 9,
   "姓名": "陳羿華",
   "性別": "男",
   "國平均": "98.4",
   "數平均": "96",
   "國數平均": "97.2",
   "加註": "h"
 },
 {
   "班級": 205,
   "座號": 10,
   "姓名": "吳定軒",
   "性別": "男",
   "國平均": "95.6",
   "數平均": "96.8",
   "國數平均": "96.2",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 11,
   "姓名": "周宇頡",
   "性別": "男",
   "國平均": "96.8",
   "數平均": "94.4",
   "國數平均": "95.6",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 12,
   "姓名": "鍾志晨",
   "性別": "男",
   "國平均": "90.6",
   "數平均": "91.2",
   "國數平均": "90.9",
   "加註": "b"
 },
 {
   "班級": 205,
   "座號": 13,
   "姓名": "盧科凱",
   "性別": "男",
   "國平均": "85",
   "數平均": "59.4",
   "國數平均": "72.2",
   "加註": "bc"
 },
 {
   "班級": 205,
   "座號": 14,
   "姓名": "王羿鈞",
   "性別": "男",
   "國平均": "85.2",
   "數平均": "72",
   "國數平均": "78.6",
   "加註": "bghd"
 },
 {
   "班級": 205,
   "座號": 15,
   "姓名": "蕭晞丞",
   "性別": "女",
   "國平均": "97.2",
   "數平均": "95.8",
   "國數平均": "96.5",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 16,
   "姓名": "黃晏嘉",
   "性別": "女",
   "國平均": "95.2",
   "數平均": "92.8",
   "國數平均": "94",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 17,
   "姓名": "盧宜君",
   "性別": "女",
   "國平均": "91.6",
   "數平均": "75.6",
   "國數平均": "83.6",
   "加註": "b+"
 },
 {
   "班級": 205,
   "座號": 18,
   "姓名": "杜宇詩",
   "性別": "女",
   "國平均": "94",
   "數平均": "94",
   "國數平均": "94",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 19,
   "姓名": "吳庭慈",
   "性別": "女",
   "國平均": "#DIV/0!",
   "數平均": "#DIV/0!",
   "國數平均": "#DIV/0!",
   "加註": "要轉學"
 },
 {
   "班級": 205,
   "座號": 20,
   "姓名": "葉映辰",
   "性別": "女",
   "國平均": "98.6",
   "數平均": "99.2",
   "國數平均": "98.9",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 21,
   "姓名": "戴莛恩",
   "性別": "女",
   "國平均": "96.8",
   "數平均": "95.2",
   "國數平均": "96",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 22,
   "姓名": "黃薇珊",
   "性別": "女",
   "國平均": "92.4",
   "數平均": "93.4",
   "國數平均": "92.9",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 23,
   "姓名": "鄭昱莛",
   "性別": "女",
   "國平均": "97.8",
   "數平均": "91.6",
   "國數平均": "94.7",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 24,
   "姓名": "林容萱",
   "性別": "女",
   "國平均": "97.8",
   "數平均": "92.8",
   "國數平均": "95.3",
   "加註": ""
 },
 {
   "班級": 205,
   "座號": 25,
   "姓名": "黃品婕",
   "性別": "女",
   "國平均": "93.6",
   "數平均": "89.2",
   "國數平均": "91.4",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 2,
   "姓名": "劉冠杰",
   "性別": "男",
   "國平均": "90",
   "數平均": "87.4",
   "國數平均": "88.7",
   "加註": "b+、e鄭兆傑"
 },
 {
   "班級": 206,
   "座號": 3,
   "姓名": "莊易宸",
   "性別": "男",
   "國平均": "96.4",
   "數平均": "93.2",
   "國數平均": "94.8",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 4,
   "姓名": "黃仕錚",
   "性別": "男",
   "國平均": "91.8",
   "數平均": "93.2",
   "國數平均": "92.5",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 5,
   "姓名": "李秉宥",
   "性別": "男",
   "國平均": "95",
   "數平均": "88.8",
   "國數平均": "91.9",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 6,
   "姓名": "鄭兆傑",
   "性別": "男",
   "國平均": "86.2",
   "數平均": "84.6",
   "國數平均": "85.4",
   "加註": "c、e劉冠杰"
 },
 {
   "班級": 206,
   "座號": 7,
   "姓名": "吳品均",
   "性別": "男",
   "國平均": "91.8",
   "數平均": "90",
   "國數平均": "90.9",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 8,
   "姓名": "林巽宇",
   "性別": "男",
   "國平均": "95.8",
   "數平均": "97.6",
   "國數平均": "96.7",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 9,
   "姓名": "陳宥鈞",
   "性別": "男",
   "國平均": "93.4",
   "數平均": "91",
   "國數平均": "92.2",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 10,
   "姓名": "陳熙爵",
   "性別": "男",
   "國平均": "94.2",
   "數平均": "87.4",
   "國數平均": "90.8",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 11,
   "姓名": "温鈞閎",
   "性別": "男",
   "國平均": "89.4",
   "數平均": "85.2",
   "國數平均": "87.3",
   "加註": "b"
 },
 {
   "班級": 206,
   "座號": 12,
   "姓名": "魏徵",
   "性別": "男",
   "國平均": "89.8",
   "數平均": "88.6",
   "國數平均": "89.2",
   "加註": "h"
 },
 {
   "班級": 206,
   "座號": 13,
   "姓名": "柳冠宇",
   "性別": "男",
   "國平均": "95.2",
   "數平均": "95.2",
   "國數平均": "95.2",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 14,
   "姓名": "蔡秉豫",
   "性別": "男",
   "國平均": "90.6",
   "數平均": "88.8",
   "國數平均": "89.7",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 15,
   "姓名": "黃鈺淇",
   "性別": "女",
   "國平均": "97.2",
   "數平均": "97.2",
   "國數平均": "97.2",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 16,
   "姓名": "彭芯渝",
   "性別": "女",
   "國平均": "95.6",
   "數平均": "86",
   "國數平均": "90.8",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 17,
   "姓名": "鄭新潔",
   "性別": "女",
   "國平均": "91.6",
   "數平均": "88",
   "國數平均": "89.8",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 18,
   "姓名": "李俐璇",
   "性別": "女",
   "國平均": "85",
   "數平均": "77.4",
   "國數平均": "81.2",
   "加註": "d"
 },
 {
   "班級": 206,
   "座號": 19,
   "姓名": "黃怡焯",
   "性別": "女",
   "國平均": "90.2",
   "數平均": "95.8",
   "國數平均": "93",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 20,
   "姓名": "鄭葦靜",
   "性別": "女",
   "國平均": "95.4",
   "數平均": "86.4",
   "國數平均": "90.9",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 21,
   "姓名": "李品澄",
   "性別": "女",
   "國平均": "90.2",
   "數平均": "77.2",
   "國數平均": "83.7",
   "加註": "h"
 },
 {
   "班級": 206,
   "座號": 22,
   "姓名": "陳怡璇",
   "性別": "女",
   "國平均": "99.2",
   "數平均": "98",
   "國數平均": "98.6",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 23,
   "姓名": "林子蘅",
   "性別": "女",
   "國平均": "97",
   "數平均": "100",
   "國數平均": "98.5",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 25,
   "姓名": "許傳捷",
   "性別": "女",
   "國平均": "98.6",
   "數平均": "93.8",
   "國數平均": "96.2",
   "加註": ""
 },
 {
   "班級": 206,
   "座號": 26,
   "姓名": "黃羽萱",
   "性別": "女",
   "國平均": "72.6",
   "數平均": "70.6",
   "國數平均": "71.6",
   "加註": "h"
 },
 {
   "班級": 207,
   "座號": 1,
   "姓名": "柯昕翰",
   "性別": "男",
   "國平均": "95.6",
   "數平均": "97",
   "國數平均": "96.3",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 2,
   "姓名": "謝柏程",
   "性別": "男",
   "國平均": "67.4",
   "數平均": "85.4",
   "國數平均": "76.4",
   "加註": "h、e卓兆澤"
 },
 {
   "班級": 207,
   "座號": 3,
   "姓名": "龔彥峻",
   "性別": "男",
   "國平均": "83.6",
   "數平均": "72.2",
   "國數平均": "77.9",
   "加註": "c"
 },
 {
   "班級": 207,
   "座號": 4,
   "姓名": "曾宇誠",
   "性別": "男",
   "國平均": "92.4",
   "數平均": "94",
   "國數平均": "93.2",
   "加註": "b要轉學"
 },
 {
   "班級": 207,
   "座號": 5,
   "姓名": "朱名堯",
   "性別": "男",
   "國平均": "91.6",
   "數平均": "93.8",
   "國數平均": "92.7",
   "加註": "b"
 },
 {
   "班級": 207,
   "座號": 6,
   "姓名": "朱立夫",
   "性別": "男",
   "國平均": "97.4",
   "數平均": "97.6",
   "國數平均": "97.5",
   "加註": "b"
 },
 {
   "班級": 207,
   "座號": 7,
   "姓名": "陳顗哲",
   "性別": "男",
   "國平均": "91.4",
   "數平均": "90",
   "國數平均": "90.7",
   "加註": "b、e卓兆澤"
 },
 {
   "班級": 207,
   "座號": 8,
   "姓名": "陳柏廷",
   "性別": "男",
   "國平均": "98.6",
   "數平均": "93.8",
   "國數平均": "96.2",
   "加註": "要轉學"
 },
 {
   "班級": 207,
   "座號": 9,
   "姓名": "黎益銘",
   "性別": "男",
   "國平均": "96.4",
   "數平均": "93.2",
   "國數平均": "94.8",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 10,
   "姓名": "葉皚威",
   "性別": "男",
   "國平均": "76.8",
   "數平均": "78",
   "國數平均": "77.4",
   "加註": "h"
 },
 {
   "班級": 207,
   "座號": 11,
   "姓名": "林翊翔",
   "性別": "男",
   "國平均": "85.4",
   "數平均": "84.8",
   "國數平均": "85.1",
   "加註": "g、e卓兆澤"
 },
 {
   "班級": 207,
   "座號": 12,
   "姓名": "林翊智",
   "性別": "男",
   "國平均": "92.8",
   "數平均": "95.8",
   "國數平均": "94.3",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 13,
   "姓名": "卓兆澤",
   "性別": "男",
   "國平均": "89.6",
   "數平均": "87.4",
   "國數平均": "88.5",
   "加註": "b、e陳顗哲林翊翔謝柏程"
 },
 {
   "班級": 207,
   "座號": 14,
   "姓名": "曾衡介",
   "性別": "男",
   "國平均": "90.8",
   "數平均": "90.4",
   "國數平均": "90.6",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 15,
   "姓名": "姜怡岑",
   "性別": "女",
   "國平均": "94.2",
   "數平均": "96.2",
   "國數平均": "95.2",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 16,
   "姓名": "彭思橙",
   "性別": "女",
   "國平均": "94.8",
   "數平均": "93.6",
   "國數平均": "94.2",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 17,
   "姓名": "李沛瀅",
   "性別": "女",
   "國平均": "98.2",
   "數平均": "96.4",
   "國數平均": "97.3",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 18,
   "姓名": "田馨兒",
   "性別": "女",
   "國平均": "92.2",
   "數平均": "85.6",
   "國數平均": "88.9",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 19,
   "姓名": "林芸安",
   "性別": "女",
   "國平均": "96.4",
   "數平均": "94.8",
   "國數平均": "95.6",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 20,
   "姓名": "曾宜辰",
   "性別": "女",
   "國平均": "98",
   "數平均": "96.4",
   "國數平均": "97.2",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 21,
   "姓名": "陳俐安",
   "性別": "女",
   "國平均": "96.6",
   "數平均": "93.2",
   "國數平均": "94.9",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 22,
   "姓名": "温婉彤",
   "性別": "女",
   "國平均": "96",
   "數平均": "96.4",
   "國數平均": "96.2",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 23,
   "姓名": "房亞莛",
   "性別": "女",
   "國平均": "82.4",
   "數平均": "78",
   "國數平均": "80.2",
   "加註": "d"
 },
 {
   "班級": 207,
   "座號": 24,
   "姓名": "林凌靚",
   "性別": "女",
   "國平均": "93.2",
   "數平均": "91.4",
   "國數平均": "92.3",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 25,
   "姓名": "梁立芸",
   "性別": "女",
   "國平均": "90.6",
   "數平均": "85.8",
   "國數平均": "88.2",
   "加註": ""
 },
 {
   "班級": 207,
   "座號": 26,
   "姓名": "江玫宣",
   "性別": "女",
   "國平均": "78.8",
   "數平均": "75.6",
   "國數平均": "77.2",
   "加註": "d"
 }
]



//   Function         built?
//1.依成績S型分班        Y
//2.原班級來源數平均     Y
//3.註記平均5項             N
//4.新班級平均           Y
//5.原班級程度分布       Y   
//6.適性導師綁定            N

//sort average grade high to low
data.sort(function (a, b) {
    return b.國數平均.localeCompare(a.國數平均);
});

var classSize = 26;
var classCount = data.length / classSize;
var classLabelArray = [];

//logic to determine number of class
if (classCount % 1 < 0.3) {
  classCount = Math.round(data.length / classSize);
} else {
  classCount = Math.ceil(data.length / classSize);
}

//empty array to hold student data
var classNum= [[],[],[],[],[],[],[],[]];
for (var i = 0; i < classNum.length; i++){
  classNum[i].students = [];
};
//s-shape placement
for (var i = 0; i < data.length; i = i + classCount + classCount) {
  var scenerio = classCount;
    if (scenerio === 4) {
      classNum[0].students.push(data[i])
      classNum[1].students.push(data[i + 1])
      classNum[2].students.push(data[i + 2])
      classNum[3].students.push(data[i + 3])
      classNum[3].students.push(data[i + 4])
      classNum[2].students.push(data[i + 5])
      classNum[1].students.push(data[i + 6])
      classNum[0].students.push(data[i + 7])
   } else if (scenerio === 5) {
      classNum[0].students.push(data[i])
      classNum[1].students.push(data[i + 1])
      classNum[2].students.push(data[i + 2])
      classNum[3].students.push(data[i + 3])
      classNum[4].students.push(data[i + 4])
      classNum[4].students.push(data[i + 5])
      classNum[3].students.push(data[i + 6])
      classNum[2].students.push(data[i + 7])
      classNum[1].students.push(data[i + 8])
      classNum[0].students.push(data[i + 9])
    } else if (scenerio === 6) {
      classNum[0].students.push(data[i])
      classNum[1].students.push(data[i + 1])
      classNum[2].students.push(data[i + 2])
      classNum[3].students.push(data[i + 3])
      classNum[4].students.push(data[i + 4])
      classNum[5].students.push(data[i + 5])
      classNum[5].students.push(data[i + 6])
      classNum[4].students.push(data[i + 7])
      classNum[3].students.push(data[i + 8])
      classNum[2].students.push(data[i + 9])
      classNum[1].students.push(data[i + 10])
      classNum[0].students.push(data[i + 11])
    } else if (scenerio === 7) {
      classNum[0].students.push(data[i])
      classNum[1].students.push(data[i + 1])
      classNum[2].students.push(data[i + 2])
      classNum[3].students.push(data[i + 3])
      classNum[4].students.push(data[i + 4])
      classNum[5].students.push(data[i + 5])
      classNum[6].students.push(data[i + 6])
      classNum[6].students.push(data[i + 7])
      classNum[5].students.push(data[i + 8])
      classNum[4].students.push(data[i + 9])
      classNum[3].students.push(data[i + 10])
      classNum[2].students.push(data[i + 11])
      classNum[1].students.push(data[i + 12])
      classNum[0].students.push(data[i + 13])
      } else if (scenerio === 8) {
      classNum[0].students.push(data[i])
      classNum[1].students.push(data[i + 1])
      classNum[2].students.push(data[i + 2])
      classNum[3].students.push(data[i + 3])
      classNum[4].students.push(data[i + 4])
      classNum[5].students.push(data[i + 5])
      classNum[6].students.push(data[i + 6])
      classNum[7].students.push(data[i + 7])
      classNum[7].students.push(data[i + 8])
      classNum[6].students.push(data[i + 9])
      classNum[5].students.push(data[i + 10])
      classNum[4].students.push(data[i + 11])
      classNum[3].students.push(data[i + 12])
      classNum[2].students.push(data[i + 13])
      classNum[1].students.push(data[i + 14])
      classNum[0].students.push(data[i + 15])
  } else {
    console.log("Class Number Not in Range (4,8)");
  }
}

//compute grade average of new class
var currentAvg = function(arr) {
  for (i =0; i<classCount ; i++) {
    arr[i].newClassStats = {"totalStudents":0, "averageGrade":0, "sumGrade": 0};
    for (j = 0; j < classSize; j++) {
      if (arr[i].students[j] !== undefined) {
        if (arr[i].students[j].國數平均 !=="#DIV/0!") {
          arr[i].newClassStats["sumGrade"] += parseInt(arr[i].students[j].國數平均)
          arr[i].newClassStats["totalStudents"] += 1
        }
      }
    }
    arr[i].newClassStats["averageGrade"] = arr[i].newClassStats["sumGrade"] /     arr[i].newClassStats["totalStudents"];
  }
}
currentAvg(classNum)

//count original source class OC: Old Class
var calculateSource = function(arr){
  for (i =0; i<classCount ; i++) {
   //default source array store number 0
    arr[i].source = {"01":0, "02":0, "03":0, "04":0,"05":0, "06":0,"07":0, "08":0};
    arr[i].sourceGrade = {"01":0, "02":0, "03":0, "04":0,"05":0, "06":0,"07":0, "08":0};
    arr[i].sourceGradeAvg = {"01":0, "02":0, "03":0, "04":0,"05":0, "06":0,"07":0, "08":0};

    for (j = 0; j < classSize; j++){
      if (arr[i].students[j] !== undefined) {
        switch (parseInt(arr[i].students[j].班級)){
          case 201:
          case 401:
            arr[i].source["01"] += 1;
            arr[i].sourceGrade["01"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["01"] = parseInt(arr[i].sourceGrade["01"]) / parseInt(classNum[i].source["01"]);
            break;
          case 202:
          case 402:
            arr[i].source["02"] += 1;
            arr[i].sourceGrade["02"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["02"] = parseInt(arr[i].sourceGrade["02"]) / parseInt(classNum[i].source["02"]);
            break;
          case 203:
          case 403:
            arr[i].source["03"] += 1;
            arr[i].sourceGrade["03"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["03"] = parseInt(arr[i].sourceGrade["03"]) / parseInt(classNum[i].source["03"]);
            break;
          case 204:
          case 404:
            arr[i].source["04"] += 1;
            arr[i].sourceGrade["04"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["04"] = parseInt(arr[i].sourceGrade["04"]) / parseInt(classNum[i].source["04"]);
            break;        
          case 205:
          case 405:
            arr[i].source["05"] += 1;
            arr[i].sourceGrade["05"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["05"] = parseInt(arr[i].sourceGrade["05"]) / parseInt(classNum[i].source["05"]);
            break; 
          case 206:
          case 406:
            arr[i].source["06"] += 1;
            arr[i].sourceGrade["06"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["06"] = parseInt(arr[i].sourceGrade["06"]) / parseInt(classNum[i].source["06"]);
            break; 
          case 207:
          case 407:
            arr[i].source["07"] += 1;
            arr[i].sourceGrade["07"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["07"] = parseInt(arr[i].sourceGrade["07"]) / parseInt(classNum[i].source["07"]);
            break; 
          case 208:
          case 408:
            arr[i].source["08"] += 1;
            arr[i].sourceGrade["08"] += parseInt(arr[i].students[j].國數平均);
            arr[i].sourceGradeAvg["08"] = parseInt(arr[i].sourceGrade["08"]) / parseInt(classNum[i].source["08"]);
            break;             
        }
      }
    }
  }
}
calculateSource(classNum);

//var classNumDup = JSON.parse(JSON.stringify(classNum));
var classNumDup ; 

//deep copy with jQjuery
//var script = document.createElement('script');
//script.src = 'https://cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.min.js';
//script.type = 'text/javascript';
//document.getElementsByTagName('head')[0].appendChild(script);
classNumDup =  jQuery.extend(true, [], classNum);

//swap students
var swapStudents = function(arr, class1, studentA, class2, studentB) {
  var temp = classNumDup[class1].students[studentA];
  classNumDup[class1].students[studentA] = classNumDup[class2].students[studentB];
  classNumDup[class2].students[studentB] = temp;
  console.log(classNumDup);
  calculateSource(classNumDup)
  currentAvg(classNumDup)
  console.log(classNumDup[1].newClassStats.averageGrade)
};
swapStudents(classNum, 1, 2, 2, 24);
;

console.log(classNum);
console.log(classNum[1].newClassStats.averageGrade);
//test
//unused log
  //console.log(classNumDup[class1].students[studentA].姓名 +" "+classNumDup[class2].students[studentB].姓名);
  //console.log(classNum[class1].students[studentA].姓名 +" "+classNum[class2].students[studentB].姓名);
  //console.log("Total Student: " + data.length);
   //console.log("Class Size: " + classSize);
   //console.log("Number of Classes: " + classCount);